# CLI Tools
brew "ack"
brew "age"
brew "atuin"
brew "awscli"
brew "bat"
brew "black"
brew "btop"
brew "coreutils"  # provides timeout (also gtimeout, gls, etc.)
brew "curl"
brew "direnv"
brew "doctl"
brew "duckdb"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gallery-dl"
brew "gh"
brew "git"
brew "gnupg"
brew "git-delta"
brew "git-lfs"
brew "git-secrets"
brew "go"
brew "goimports"
brew "golangci-lint"
brew "gopls"
brew "gofumpt"
brew "go-task"
brew "helix"
brew "httpie"
brew "icdiff"
brew "imagemagick"
brew "jo"
brew "jq"
brew "lazygit"
brew "less"
brew "llm"
brew "mas"
brew "mosh"
brew "node"
brew "pinentry-mac"
brew "nvim"
brew "pipenv"
brew "postgresql"
brew "python"
brew "ripgrep"
brew "rsync"
brew "ruff"
brew "shellcheck"
brew "starship"
brew "tmux"
brew "uv"
brew "watch"
brew "watchman"
brew "wget"
brew "yarn"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
#brew "youtube-dl"
#brew "yle-dl"

# Applications
cask "1password"
cask "1password-cli"
cask "codex"
cask "discord"
cask "firefox"
cask "fork"
cask "iina"
cask "insomnia"
cask "istat-menus"
cask "spotify"
cask "telegram-desktop"
cask "transmit"
#cask "google-chrome"

#mas "Parcel", id: 639968404
#mas "PiPifier", id: 1160374471

