tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# CLI Tools
brew "ack"
brew "awscli"
brew "bat"
brew "black"
brew "btop"
brew "direnv"
brew "doctl"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "git-secrets"
brew "go"
brew "httpie"
brew "icdiff"
brew "jo"
brew "jq"
brew "less"
brew "mas"
brew "mise"
brew "mosh"
brew "node"
brew "pipenv"
brew "python"
brew "ripgrep"
brew "rsync"
brew "shellcheck"
brew "starship"
brew "terraform"
brew "tmux"
brew "watch"
brew "watchman"
brew "wget"
brew "yarn"
brew "zoxide"
#brew "youtube-dl"
#brew "yle-dl"

# Fonts
cask "font-fira-code"
cask "font-fira-mono"
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"

# Applications
cask "1password"
cask "discord"
cask "firefox"
cask "fork"
cask "hazel"
cask "iina"
cask "insomnia"
cask "istat-menus"
cask "rectangle"
cask "spotify"
cask "telegram-desktop"
cask "transmit"
cask "wezterm"
#cask "google-chrome"

#mas "Parcel", id: 639968404
#mas "PiPifier", id: 1160374471

